Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartFitFailWarning Property
 Fabrication Part Fitting Failed to Fit
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartFitFailWarning { get; }
Public Shared ReadOnly Property FabricationPartFitFailWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartFitFailWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartFitFailWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace